{
    "Study": {
        "description": "You are in the study where the scientist first contacted you.",
        "prompt_phrases": [
            "Detective, please! I can’t think straight in this room…",
            "Hurry! I feel uneasy being here alone!",
            "The shadows in this study make me nervous… decide quickly!",
            "I don’t want to linger here… guide me!",
            "Every second I stay here, I feel dread creeping in!",
            "Please, we must act before my fear overtakes me!",
            "I’m anxious… something feels off here!",
            "The ticking clock is maddening… choose!",
            "I feel trapped… hurry!",
            "Detective, I beg you, decide swiftly!"
        ],
        "options": {
            "1": {
                "option_phrase": "I can step out into the street… dial 1",
                "response_phrase": "I step cautiously into the street, peering for clues.",
                "next_location": "Street"
            },
            "2": {
                "option_phrase": "Shall I bend down and examine the body… dial 2",
                "response_phrase": "I approach the body, trying to discern what happened.",
                "next_location": "Body"
            },
            "3": {
                "option_phrase": "If you dial three, I will pry into the desk…",
                "response_phrase": "I move to the desk, sifting through papers for hints.",
                "next_location": "Desk"
            }
        }
    },
    "Street": {
        "description": "The street outside is dim and foggy, faint noises echo around.",
        "prompt_phrases": [
            "Detective, I feel someone could jump us from the shadows!",
            "The fog makes me uneasy… we must move quickly!",
            "I fear being attacked if we linger here!",
            "Something feels wrong out here… please guide me!",
            "We can’t stay in this open street… choose swiftly!",
            "Every shadow seems alive… hurry!",
            "I feel hunted… make a choice!",
            "Please, detective, we must keep moving before danger finds us!",
            "The street is too dangerous to hesitate!",
            "I can hear footsteps… we must act!"
        ],
        "options": {
            "1": {
                "option_phrase": "Bootprints trail away… should I follow? Dial 1",
                "response_phrase": "I follow the trail cautiously, hoping to uncover clues.",
                "next_location": "Alley"
            },
            "2": {
                "option_phrase": "A constable stands nearby… shall I question him? Dial 2",
                "response_phrase": "I approach the policeman, asking if he noticed anything unusual.",
                "next_location": "Policeman"
            },
            "3": {
                "option_phrase": "I can retreat back into the house… dial 3",
                "response_phrase": "I hurry back into the study, reconsidering our options.",
                "next_location": "Study"
            }
        }
    },
    "Body": {
        "description": "The victim lies on the ground, lifeless, with signs of a struggle.",
        "prompt_phrases": [
            "Detective, it’s horrible… I feel sick looking at this!",
            "I can hardly stand to see him… please decide quickly!",
            "The sight of blood makes me shiver… act now!",
            "Oh heavens, the wound… I’m terrified… choose!",
            "I feel nauseated… we must move before someone finds us here!",
            "Please, detective, I can’t stay near this body much longer!",
            "Every second near him is dreadful… hurry!",
            "The body’s eyes seem to stare at me… guide me!",
            "I am trembling… decide swiftly!",
            "I beg you, detective, before I lose my nerve completely!"
        ],
        "options": {
            "1": {
                "option_phrase": "Do you wish me to peer at the wound… dial 1",
                "response_phrase": "I examine the wound carefully, noting its details.",
                "next_location": "Body"
            },
            "2": {
                "option_phrase": "If you prefer, dial two, and I’ll rummage in his pockets…",
                "response_phrase": "I search the victim’s pockets for any evidence.",
                "next_location": "Body"
            },
            "3": {
                "option_phrase": "Or we may return to the study… dial 3",
                "response_phrase": "I head back to the study, pondering our next steps.",
                "next_location": "Study"
            }
        }
    },
    "Desk": {
        "description": "A cluttered desk holds papers, a quill, and a locked drawer.",
        "prompt_phrases": [
            "Detective, perhaps the desk holds secrets… I must find them quickly!",
            "I feel anxious sifting through this mess… hurry!",
            "Time is critical… what should I look at first?",
            "These papers could be important… decide!",
            "I fear leaving clues behind if I delay… act now!",
            "The drawer seems promising, but I’m nervous… choose!",
            "I can’t waste time on trifles… guide me!",
            "The quill shakes in my hand… hurry, detective!",
            "Please, decide soon… I’m uneasy here!",
            "Something may reveal the truth… quickly!"
        ],
        "options": {
            "1": {
                "option_phrase": "Should I inspect the scattered papers… dial 1",
                "response_phrase": "I sift through the papers, noting anything unusual.",
                "next_location": "Desk"
            },
            "2": {
                "option_phrase": "I could examine the locked drawer… dial 2",
                "response_phrase": "I try the drawer, hoping to find a clue inside.",
                "next_location": "Drawer"
            },
            "3": {
                "option_phrase": "Or step back into the study… dial 3",
                "response_phrase": "I return to the study, regrouping our approach.",
                "next_location": "Study"
            }
        }
    },
    "Drawer": {
        "description": "A locked drawer that might contain hidden evidence.",
        "prompt_phrases": [
            "Detective, the drawer might hide the truth… we must open it!",
            "I tremble at what we might find… choose quickly!",
            "Time is fleeting… I’m anxious to see inside!",
            "Hurry, detective, every second counts!",
            "I fear someone might return… act now!",
            "The lock resists my hand… please guide me!",
            "I am nervous, but we must see the contents…",
            "Decide swiftly, detective, I’m uneasy here!",
            "I feel like I’m being watched… hurry!",
            "Every moment we wait, evidence may disappear!"
        ],
        "options": {
            "1": {
                "option_phrase": "Try to pick the lock… dial 1",
                "response_phrase": "I attempt to pick the lock, hoping for success.",
                "next_location": "Drawer"
            },
            "2": {
                "option_phrase": "Examine the papers nearby instead… dial 2",
                "response_phrase": "I scrutinize the papers for anything revealing.",
                "next_location": "Desk"
            },
            "3": {
                "option_phrase": "Return to the study… dial 3",
                "response_phrase": "I step back into the study to reconsider our plan.",
                "next_location": "Study"
            }
        }
    },
    "Alley": {
        "description": "A narrow alley, shadows lurk in every corner.",
        "prompt_phrases": [
            "Detective, the alley is sinister… I fear being ambushed!",
            "The darkness feels alive… we must move!",
            "I can hear every footstep echoing… act now!",
            "Something might jump us from the shadows… choose quickly!",
            "I shiver at this place… guide me, detective!",
            "We cannot linger… danger could be near!",
            "Every second here feels perilous… hurry!",
            "I feel eyes on us… decide!",
            "Please, act before we are discovered!",
            "The alley’s darkness hides threats… quickly!"
        ],
        "options": {
            "1": {
                "option_phrase": "Follow the faint light ahead… dial 1",
                "response_phrase": "I move toward the faint light, wary of what’s lurking.",
                "next_location": "Laboratory"
            },
            "2": {
                "option_phrase": "Return to the street… dial 2",
                "response_phrase": "I backtrack to the safety of the street.",
                "next_location": "Street"
            },
            "3": {
                "option_phrase": "Investigate the shadowed doorway… dial 3",
                "response_phrase": "I peer into the dark doorway, heart racing.",
                "next_location": "BackDoor"
            }
        }
    },
    "Policeman": {
        "description": "A lone constable, looking alert but suspicious.",
        "prompt_phrases": [
            "Detective, he might not be trustworthy… decide quickly!",
            "I’m uneasy approaching him… hurry!",
            "We need his information before he moves on!",
            "Every moment wasted could alert others… act!",
            "I tremble near his stern gaze… choose!",
            "Please, detective, guide me… I feel watched!",
            "Time is slipping… we need answers!",
            "I can sense tension… act quickly!",
            "The constable may not stay here long… decide!",
            "I’m nervous… every second counts!"
        ],
        "options": {
            "1": {
                "option_phrase": "Ask about suspicious persons… dial 1",
                "response_phrase": "I question him about anyone unusual in the area.",
                "next_location": "Policeman"
            },
            "2": {
                "option_phrase": "Ask if he saw a struggle… dial 2",
                "response_phrase": "I inquire if he witnessed a fight or disturbance.",
                "next_location": "Policeman"
            },
            "3": {
                "option_phrase": "Return to the street… dial 3",
                "response_phrase": "I retreat to the street to reconsider our options.",
                "next_location": "Street"
            }
        }
    },
    "BackDoor": {
        "description": "A hidden door at the back, leading to an unknown room.",
        "prompt_phrases": [
            "Detective, this could be dangerous… should we enter?",
            "I feel a chill… hurry!",
            "Every second outside this door is tense… act!",
            "I sense danger inside… choose quickly!",
            "Please, detective, we can’t hesitate here!",
            "My heart races at this entrance… decide!",
            "I fear what might be waiting… move!",
            "Time is slipping… guide me!",
            "The door creaks ominously… act swiftly!",
            "I beg you, detective, before curiosity costs us!"
        ],
        "options": {
            "1": {
                "option_phrase": "Open the door slowly… dial 1",
                "response_phrase": "I ease the door open, peering into darkness.",
                "next_location": "Bedroom"
            },
            "2": {
                "option_phrase": "Step back to the alley… dial 2",
                "response_phrase": "I retreat to the relative safety of the alley.",
                "next_location": "Alley"
            },
            "3": {
                "option_phrase": "Listen carefully outside… dial 3",
                "response_phrase": "I press my ear to the door, straining to hear.",
                "next_location": "BackDoor"
            }
        }
    },
    "Bedroom": {
        "description": "A lavish bedroom, slightly disheveled, curtains drawn.",
        "prompt_phrases": [
            "Detective, it’s quiet… too quiet… should we investigate?",
            "I fear someone could be hiding here… act quickly!",
            "Every shadow in this room unsettles me… decide!",
            "Please, detective, move before we miss a clue!",
            "I’m anxious… the curtains make it darker… hurry!",
            "Something feels off… we must act!",
            "My hands tremble… guide me!",
            "Time is pressing… we can’t linger!",
            "I feel eyes on us even in this empty room… choose!",
            "Detective, I beg you, act before we lose the trail!"
        ],
        "options": {
            "1": {
                "option_phrase": "Search the drawers… dial 1",
                "response_phrase": "I open the drawers, hoping to uncover evidence.",
                "next_location": "Drawer"
            },
            "2": {
                "option_phrase": "Look under the bed… dial 2",
                "response_phrase": "I peer beneath the bed, heart pounding.",
                "next_location": "Bedroom"
            },
            "3": {
                "option_phrase": "Return to the back door… dial 3",
                "response_phrase": "I step back to the hidden back entrance.",
                "next_location": "BackDoor"
            }
        }
    },
    "Laboratory": {
        "description": "The laboratory reeks of chemicals, glass vials glint in the dim light.",
        "prompt_phrases": [
            "Detective, the fumes sting my eyes… we must act quickly!",
            "This room feels dangerous… choose swiftly!",
            "The vials could shatter at any moment… hurry!",
            "I tremble surrounded by strange apparatus… act!",
            "Please, detective, something about this place unnerves me!",
            "I fear poisoning just standing here… decide!",
            "The shadows hide all manner of dangers… hurry!",
            "Every second in here feels perilous!",
            "I can almost hear the glass creaking… choose quickly!",
            "Detective, I beg you, before the chemicals overwhelm me!"
        ],
        "options": {
            "1": {
                "option_phrase": "Shall I inspect the chemical vials… dial 1",
                "response_phrase": "I peer at the vials, trying to discern their contents.",
                "next_location": "Laboratory"
            },
            "2": {
                "option_phrase": "There’s a journal on the bench… dial 2",
                "response_phrase": "I flip through the scientist’s journal, noting entries.",
                "next_location": "Laboratory"
            },
            "3": {
                "option_phrase": "If you wish me to leave, dial 3",
                "response_phrase": "I slip out of the laboratory into the alley again.",
                "next_location": "Alley"
            }
        }
    }
}
